# int - Целые числа 1+1=2
# float - Дробные числа 1.0 +1.0 = 2.0
# str - Строковые значения 1+1 = 11


# int() - преобразование в int
# float() - преобразование в float
# str() - преобразование в str

# Циклы
# while - Цикл с условием
# for - Цикл с заданным количеством повторений

# range(start, stop, step) - последовательность
# - start -- точку начала. Она входит в последовательность
# - stop -- точка конца. Она в последовательность не входит.
# - step -- шаг. Значение, которое мы добавляем к т. старта


"""try:
    value1 = int(input("Введите число №1: "))
except ValueError:
    print("Ошибка ввода! Вы ввели не число!")"""
